app/controllers/api/v1/categories_controller.rb

SELECT "categories".* FROM "categories" ORDER BY "categories"."created_at" DESC
---
  def index
    categorie = Categorie.all.order(created_at: :desc)