app/controllers/categories_controller.rb

  def index
    @categories = Categorie.all
---
SELECT "categories".* FROM "categories"

  def create
    @categorie = Categorie.new(categorie_params)

    respond_to do |format|
      if @categorie.save
---
INSERT INTO "categories" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "code"], ["description", "bala bala bzehfkjhezf"], ["created_at", "2022-06-28 05:55:06.851851"], ["updated_at", "2022-06-28 05:55:06.851851"]]

    def set_categorie
      @categorie = Categorie.find(params[:id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]